name: "my_first_net"

layer {
  name: "data"
  type: "Data"
  top: "data"
  top: "label"
  include {
    phase: TRAIN
  }
  data_param {
    source: "/home/marta/PycharmProjects/learning_caffe/resource/train_lmdb"
    batch_size: 50
    backend: LMDB
  }
}
layer {
  name: "data"
  type: "Data"
  top: "data"
  top: "label"
  include {
    phase: TEST
  }
  data_param {
  source: "/home/marta/PycharmProjects/learning_caffe/resource/test_lmdb"
    batch_size: 50
    backend: LMDB
   }
}

layer {
  name: "conv"
  type: "Convolution"
  bottom: "data"
  top: "conv"
  convolution_param {
    num_output: 10
    kernel_size: 3
    stride: 1
    weight_filler {
        type: 'gaussian'
        std: 0.01
    }
    bias_filler {
        type: 'constant'
        value: 0
    }
  }
}

layer {
  name: "pool"
  type: "Pooling"
  bottom: "conv"
  top: "pool"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 2
  }
}

layer {
  name: "relu"
  type: "ReLU"
  bottom: "pool"
  top: "pool"
}

layer {
  name: "prob"
  type: "Softmax"
  bottom: "pool"
  top: "prob"
}